[Killed] BlockStatement
math.js:2:20
 // math.js
-function add(a, b) {
-  return a + b + 0;
-}
+function add(a, b) {}
 function subtract(a, b) {
   return a - b;
killedBy: adds 2 + 3 to equal 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Killed] ArithmeticOperator
math.js:3:10
 // math.js
 function add(a, b) {
-  return a + b + 0;
+  return a - b + 0;
 }
 function subtract(a, b) {
killedBy: adds 2 + 3 to equal 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: -1

[Survived] ArithmeticOperator
math.js:3:10
 // math.js
 function add(a, b) {
-  return a + b + 0;
+  return a + b - 0;
 }
 function subtract(a, b) {
